{
  "A/B test": {
    "_note": "A paywall experiment in Adapty that splits users into groups to compare different paywalls within the same placement.",
    "zh": "A/B 测试"
  },
  "access level": {
    "_note": "An abstract named tier in Adapty (e.g. 'premium') that products grant upon purchase. Determines which app features a user can access. Not a subscription itself — multiple products can grant the same access level.",
    "zh": "访问级别"
  },
  "Adapty Dashboard": {
    "_note": "The Adapty web application at app.adapty.io where products, paywalls, placements, and A/B tests are configured.",
    "zh": "Adapty 控制台"
  },
  "attribution": {
    "_note": "Marketing source data attached to a user profile (channel, campaign, ad group, creative) indicating how the user was acquired. Fed into Adapty via MMP integrations or Apple Ads Manager.",
    "zh": "归因"
  },
  "audience": {
    "_note": "A named set of user conditions (country, subscription status, custom attributes, etc.) attached to a placement. Evaluated at runtime to decide which paywall or A/B test variant a user sees.",
    "zh": "受众"
  },
  "cohort": {
    "_note": "A group of users who installed the app in the same time window, tracked together in Adapty Analytics to measure retention, trial conversion, and predicted lifetime value.",
    "zh": "同期群"
  },
  "consumable": {
    "_note": "A one-time purchase that can be bought multiple times (e.g. in-game coins). Adapty records each transaction separately; consumables have no duration or expiration.",
    "zh": "消耗型商品"
  },
  "fallback paywall": {
    "_note": "A locally cached paywall bundled with the app and shown when the device has no internet or the Adapty server is unreachable. Configured per placement in the dashboard and downloaded at SDK init.",
    "zh": "备用付费墙"
  },
  "grace period": {
    "_note": "A short window after a subscription renewal payment fails during which Adapty continues granting access while the store retries the charge. Length is set in App Store Connect or Google Play.",
    "zh": "宽限期"
  },
  "introductory offer": {
    "_note": "A one-time discounted or free-trial period for first-time subscribers, configured in App Store Connect or Google Play Console.",
    "zh": "新用户优惠"
  },
  "lifetime access": {
    "_note": "A non-renewable one-time purchase that grants permanent, non-expiring access to content or features. Adapty records no renewal events for lifetime products.",
    "zh": "永久授权"
  },
  "one-time purchase": {
    "_note": "In Adapty, a product that is not a subscription. May be consumable (can be purchased repeatedly) or non-consumable (permanent single purchase). Also labelled 'non-subscription' in the dashboard.",
    "zh": "一次性购买"
  },
  "onboarding": {
    "_note": "A noun in Adapty — a sequence of screens shown to new users to introduce the app and present subscription options. Used as both singular ('an onboarding') and plural ('onboardings'). Not a verb here. Onboardings are placed in placements just like paywalls and can be A/B tested.",
    "zh": "引导页"
  },
  "Paywall Builder": {
    "_note": "Adapty's visual no-code editor for designing paywalls using pre-built templates and drag-and-drop elements. Apps on SDK v2.x use the Legacy Builder; SDK v3+ use the New Paywall Builder.",
    "zh": "付费墙构建器"
  },
  "paywall": {
    "_note": "In Adapty, a paywall is not necessarily a visual screen — it is any configured set of products presented to a user at a placement. Can be a full UI built with Paywall Builder, a remotely configured custom layout, or a minimal programmatic product list. The defining feature is that it is the vehicle for presenting and selling products.",
    "zh": "付费墙"
  },
  "placement": {
    "_note": "A named location in the app (e.g. 'onboarding', 'settings') where a paywall is shown. The paywall shown there can be swapped from the dashboard without an app update.",
    "zh": "版位"
  },
  "product": {
    "_note": "In Adapty, a product is any in-app purchase item — subscriptions, one-time purchases, consumables, and lifetime access are all 'products'. Not limited to subscriptions. Products are configured in the dashboard, grouped, priced, and attached to paywalls.",
    "zh": "产品"
  },
  "promotional offer": {
    "_note": "A discounted or free-trial price offered to existing or lapsed subscribers, configured in App Store Connect or Google Play Console.",
    "zh": "促销优惠"
  },
  "remote config": {
    "_note": "Key-value data attached to a paywall in the Adapty Dashboard that the app reads at runtime to customize UI without a code change.",
    "zh": "远程配置"
  },
  "sandbox": {
    "_note": "The test purchase environment provided by App Store, Google Play, Stripe, or Paddle. Adapty processes sandbox transactions separately and excludes them from production analytics by default.",
    "zh": "沙盒"
  },
  "segment": {
    "_note": "A saved set of user filter conditions used for analytics breakdowns and as targeting criteria inside audiences. Unlike audiences (evaluated at runtime per placement), segments are pre-defined reusable filters.",
    "zh": "用户分群"
  },
  "subscription": {
    "_note": "An auto-renewable or non-renewable in-app purchase product sold through the App Store or Google Play.",
    "zh": "订阅"
  },
  "variant": {
    "_note": "One of the paywall options tested within an A/B test. Each variant has a traffic weight (percentage of eligible users who see it). The winning variant is promoted to 100% when the test ends.",
    "zh": "实验变体"
  },
  "win-back offer": {
    "_note": "A promotional offer targeted at lapsed subscribers who previously canceled or churned, used to re-engage them with a discounted price or free trial.",
    "zh": "赢回优惠"
  }
}
